import { createApp } from 'vue'; // Импортируем функцию createApp из библиотеки Vue для создания экземпляра приложения
import App from './App.vue'; // Импортируем корневой компонент приложения из файла App.vue
import router from './router'; // Импортируем маршрутизатор из файла router.js. 

const app = createApp(App); // Создаем экземпляр приложения, используя корневой компонент App
app.use(router); // Подключаем маршрутизатор к экземпляру приложения, чтобы он мог использовать маршруты

app.mount('#app'); // Монтируем (присоединяем) экземпляр приложения к DOM-элементу с идентификатором "app" на странице
